// Гра «Поле чудес». По аналогії до відомогої телегри необхідно вгадати одне із слів, яке випадковим
// чином вибирається з масиву-константи (два масиви: в одному зберігається слово, а у іншому масиві
// під тим же номером зберігається рядок-підказка до слова). Барабан представлено у вигляді
// одновимірного масиву і при прокручуванні барабана просто випадковим чином вибирається номер
// поля.

import 'dart:io';
import 'dart:math';

void task5() {
  var words = const ["собака", "сонце", "автомобіль", "ноутбук", "кавун"];
  var hints = const [
    "друг людини",
    "зірка",
    "транспортний засіб",
    "переносний комп'ютер",
    "велика ягода"
  ];

  int r = Random().nextInt(5);
  String guess = '';
  stdout.write('Вгадайте слово(підказка: ${hints[r]}): ');
  for (int i = 0; i < 3; i++) {
    guess = stdin.readLineSync()!;
    if (guess == words[r]) {
      print('Ви вгадали!');
    } else if (i == 2) {
      print("Ви програли(слово, що було загадане): ${words[r]}");
    } else {
      print(guess);
      print('Спробуйте ще раз');
    }
  }
}
